# organization-api - production
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

module.common_resources.module.database_user.random_password.password: Refreshing state... [id=none]
module.common_resources.module.aws_lambda.data.archive_file.default: Reading...
module.common_resources.module.aws_lambda.aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/lambda/production-organization-api]
module.common_resources.module.database_user.data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.module.aws_api_gateway.aws_apigatewayv2_api.default: Refreshing state... [id=hswevgtvh1]
module.common_resources.module.aws_lambda.data.aws_iam_policy_document.default: Reading...
module.common_resources.module.kafka_topic_credential.data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.module.aws_lambda.data.aws_iam_policy_document.default: Read complete after 0s [id=3693445097]
module.common_resources.module.aws_lambda.aws_iam_role.default: Refreshing state... [id=lambda-execution-organization-api-production]
module.common_resources.module.kafka_topic_credential.data.aws_ssm_parameter.cluster_id: Read complete after 1s [id=production-kafka-cluster-id]
module.common_resources.module.database_user.data.aws_ssm_parameter.cluster_id: Read complete after 1s [id=production-cockroachdb-serverless-cluster-id]
module.common_resources.module.database_user.cockroach_sql_user.default: Refreshing state... [id=2539ad74-c3bc-4b10-bb6e-e55edf9e9fbf:production-organization-api]
module.common_resources.module.aws_api_gateway.aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/api_gateway/production-organization-api]
module.common_resources.module.aws_lambda.aws_iam_role_policy_attachment.default: Refreshing state... [id=lambda-execution-organization-api-production-20230427100937891900000001]
module.common_resources.module.aws_api_gateway.aws_apigatewayv2_stage.default: Refreshing state... [id=$default]
module.common_resources.module.aws_lambda.data.archive_file.default: Read complete after 1s [id=e48c590098fe5d3eef88e1ab720b45d9f3f3f341]
module.common_resources.module.aws_lambda.aws_lambda_function.default: Refreshing state... [id=production-organization-api]
module.common_resources.module.aws_api_gateway.aws_lambda_permission.default: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.common_resources.module.aws_api_gateway.aws_apigatewayv2_integration.default: Refreshing state... [id=qxkqfxq]
module.common_resources.module.aws_api_gateway.aws_apigatewayv2_route.any: Refreshing state... [id=r2xrv3o]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.common_resources.module.aws_lambda.aws_lambda_function.default will be updated in-place
  ~ resource "aws_lambda_function" "default" {
        id                             = "production-organization-api"
        tags                           = {
            "domain"        = "organization"
            "environment"   = "production"
            "resource"      = "organization-api"
            "resource_type" = "lambda"
        }
        # (22 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "CONNECTILLY_POSTGRES_CONNECTIONSTRING" = (sensitive value)
            } -> (known after apply)
        }

        # (2 unchanged blocks hidden)
    }

  # module.common_resources.module.database_user.data.cockroach_connection_string.default will be read during apply
  # (config refers to values not yet known)
 <= data "cockroach_connection_string" "default" {
      + connection_params = (known after apply)
      + connection_string = (known after apply)
      + database          = "production-organization"
      + id                = (sensitive value)
      + os                = (known after apply)
      + password          = (sensitive value)
      + sql_user          = "production-organization-api"
    }

  # module.common_resources.module.database_user.cockroach_sql_user.default will be updated in-place
  ~ resource "cockroach_sql_user" "default" {
        id         = "2539ad74-c3bc-4b10-bb6e-e55edf9e9fbf:production-organization-api"
        name       = "production-organization-api"
      ~ password   = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.common_resources.module.database_user.random_password.password must be replaced
-/+ resource "random_password" "password" {
      ~ bcrypt_hash      = (sensitive value)
      ~ id               = "none" -> (known after apply)
      ~ keepers          = { # forces replacement
          ~ "random_seed" = "d7578c43-e316-447f-a0b7-864c586a937c" -> "1ab60d13-961b-44ba-94c0-71c0df93cd88"
        }
      ~ result           = (sensitive value)
        # (11 unchanged attributes hidden)
    }

  # module.common_resources.module.kafka_topic_credential.upstash_kafka_credential.default will be created
  + resource "upstash_kafka_credential" "default" {
      + cluster_id      = (sensitive value)
      + creation_time   = (known after apply)
      + credential_id   = (known after apply)
      + credential_name = "organization-api"
      + id              = (known after apply)
      + password        = (sensitive value)
      + permissions     = "ALL"
      + state           = (known after apply)
      + topic           = "organization.v1"
      + username        = (known after apply)
    }

Plan: 2 to add, 2 to change, 1 to destroy.

Changes to Outputs:
  ~ database_user_connection_string = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*